[
  {
    "id": 1,
    "post": "Uncomfortable Truth for Employers:\n\nPeople don’t just quit jobs, they quit toxic workplaces.\n\nHere are 6 ways to stop your top talent from leaving:\n\n➡️ Don’t promote or tolerate bad behaviour.\n➡️ Pay people fairly and on time ALWAYS.\n➡️ Regularly give and ask for feedback.\n➡️ Talk about growth opportunities.\n➡️ Prioritise work-life balance.\n➡️ Communicate effectively.\n➡️ Make culture a priority.\n➡️ Show empathy.\n\nDon’t let your best people walk away.\n\nTake control of your work environment.\nAnd lead with emotional intelligence.\n\nYour team will pay you back tenfold.\n\n♻️ Repost this to spread the word.\nAnd follow Chris Donnelly for more"
  },
  {
    "id": 2,
    "post": "Those that get the 6-figure job offers are not the smartest.\n\nThey are simply the most prepared.\n\nThe candidates with the highest chance to succeed ensure:\n\n🧳 They understand what the role entails.\n🗣️ They have 4-5 great stories to hand.\n🔍 They’ve done hours of research.\n\nIn order to land the job of your dreams...\nPrepare for these 12 common interview questions.\n\nTake a sneak peek at the sheet:\n\n1. Tell me about yourself and your background.\n↳ Tell them about your career journey and the experience you have.\n↳ Tell them what you're passionate about and how it relates to the role.\n\n2. Why do you want to work for this company?\n↳ Demonstrate the research you've done, mentioning specific details.\n↳ Then relate that knowledge to the position you've applied for.\n\n3. How do you deal with pressure or stressful situations?\n↳ Share an example of a previous stressful situation you handled with grace.\n↳ Talk about how you've improved over time.\n\n4. What is the hardest problem you’ve ever tackled?\n↳ Discuss in detail how you tackled the problem.\n↳ Explain clearly how you solved it and the impact it had.\n\n5. What sets you apart from other applicants?\n↳ Talk about your unique strengths that relate to the role.\n↳ Discuss how you developed them over time.\n\n6. What are the main strengths you’ll bring to us?\n↳ Talk about your biggest strengths and how you will apply them.\n↳ Then share exactly how you think it will benefit the business.\n\n7. What would you say are your weaknesses and how would you improve them?\n↳ Be honest and share your genuine weaknesses, don't be fake.\n↳ Lay out the roadmap for how you want to improve them.\n\n8. Describe a situation where you had to handle multiple responsibilities.\n↳ Talk about how you were organised and prepared.\n↳ Go in detail on how you spin multiple plates.\n\n9. Tell me a time when you couldn’t meet a deadline and how you handled it?\n↳ Discuss honestly about how disappointed you were.\n↳ Then go on to say how you reflected and learned from it.\n\n10. Share an example of how you handled working with someone who’s difficult.\n↳ Touch on how you communicated clearly with them.\n↳ Share that it came from a place of empathy.\n\n11. Why did you want to leave your current place of work?\n↳ Flip the question on its head and talk positively about them.\n↳ But go on to say how you want a new challenge.\n\n12. Do you have any questions for us?\n↳ This is your opportunity to demonstrate your intense research.\n↳ Ask 3-5 highly specific questions.\n\nSave this sheet for later use.\nTo ensure you're prepared for your next interview!\n\nWhat's your best interview advice?\nLet me know in the comments ⬇️\n\n♻️ Repost this to help others land their dream roles.\nAnd follow Chris Donnelly for more.\n\n- - - -\n\n📌 If you want a high-res PDF of this sheet:\n\n1. Follow Chris Donnelly\n2. Like the post.\n3. Repost to your network.\n4. Subscribe to: https://lnkd.in/eXSNaDiu"
  },
  {
    "id": 3,
    "post": "Good leadership is not a mystery.\n\nIts a skill you can learn.\n\n- - - -\n\nA lot of leadership advice focusing on the negatives and what shouldn’t be happening. Sometimes that is important.\n\nSometimes, knowing what “good looks like” is important too.\n\nModel good. Celebrate good.\n\nIf you like this content and it resonates, follow me Chris Donnelly for more like it."
  },
  {
    "id": 4,
    "post": "Your title doesn't make you a leader.\n\nHow you choose to communicate with your employees does.\n\n10 FREE Management Courses to Try Today 🔥\n\nAnother fantastic resource post from Project Management\n\n1. Google Project Management: Professional Certificate\nTaught by Google experts who used project management to launch their career.\n↳ https://lnkd.in/dz7gKfTN\n\n2. IBM Project Manager Professional Certificate\nBuild the insights, skills and portfolio to have an advantage in the job market.\n↳ https://lnkd.in/drqTnbdk\n\n3. AI Product Management Specialization\nTeaches you to manage Design & Development of Machine Learning Products.\n↳ https://lnkd.in/dGEFqQgJ\n\n4. Fundamentals of Project Planning and Management\nThis course covers the core concepts of planning and executing projects.\n↳ https://lnkd.in/d9xk4RUk\n\n5. Scrum Master Certification Specialization\nLearn and understand how to manage events and tasks in a sprint.\n↳ https://lnkd.in/dAM_zwcK\n\n6. Project Management: Tools, Approaches, Behavioural Skills\nLearn the primary tools, techniques and approaches to plan projects.\n↳ https://lnkd.in/dn25rt-Z\n\n7. Agile with Atlassian Jira\nLearn the common fundamental principles and practices used by agile.\n↳ https://lnkd.in/dtaiBV6S\n\n8. Software Product Management Specialization\nApply Agile software management practices to team leadership and projects.\n↳ https://lnkd.in/dixCqGkt\n\n9. Project Management Principles and Practices Specialization\nUnderstand the skills to guarantee project success, within budget and deadline.\n↳ https://lnkd.in/dZ4UR_Uw\n\n10. Engineering Project Management Specialisation\nGain the knowledge, and skills that you need to move into leadership positions.\n↳ https://lnkd.in/d-pbwjJg\n\n♻️ Repost this to share this sheet with your network.\nAnd follow Chris Donnelly for more!\n\nDo you want a high-resolution PDF of all these courses and their links?\n\n1. ♻️ Repost this to your network\n2. Comment on this post\n3. Follow Chris Donnelly\n4. Subscribe to: https://lnkd.in/eXSNaDiu"
  },
  {
    "id": 5,
    "post": "A good manager can change your life.\n\nThe impact of a good manager extends far beyond your day to day work.\n\nIt impacts your progression, your development and your learning of skills.\n\nIt impacts your confidence and your motivation to take on more responsibility and progression.\n\nA good manager creates a positive working environment where everyone, from extroverts to introverts, feels safe speaking out and contributing .\n\nThey can help you chart your career, create balance in your life and really grow as a person.\n\nIf you are a manager, be the manager you wish you had.\n\nIf you like this post, follow me Chris Donnelly for more content like it."
  },
  {
    "id": 6,
    "post": "Stop trying to hire the smartest people.\n\nHire people who have these 9 traits instead:\n\nToo many businesses put too much emphasis on:\n\n- Qualifications\n- Experience\n- High IQ\n\nAnd focus less on the intangibles.\nThe traits that you can’t teach to people.\n\nHere are 9 rare traits in every High Performer\nAfter hiring 500+ people:\n\n1. Gets Sh#t Done\n↳ The ability to persist through any challenge.\n↳ Is known for completing things fast.\n↳ Super trustworthy with tasks.\n\n2. Self-Awareness\n↳ Are aware of their strengths and weaknesses.\n↳ Knows how to improve their weaknesses.\n↳ Will understand how long it takes to complete work.\n\n3. Shows Empathy\n↳ Treats everyone with respect.\n↳ Will go into conversations with full empathy.\n↳ Understands the struggles of others.\n\n4. Strong Communicator\n↳ Can communicate ideas & concepts very well.\n↳ Can communicate with all types of people.\n↳ Communicates clearly and at speed.\n\n5. Great At Simplifying\n↳ Great at breaking complex things down into simple ways.\n↳ Keeps things short and simple.\n↳ Understands difficult topics very well.\n\n6. Control Over Emotions\n↳ Can handle stress very well.\n↳ Never let emotions affect decisions.\n↳ Knows when to take a step back.\n\n7. Speaks Up\n↳ Doesn’t just accept things.\n↳ Wants to see positive change.\n↳ Will speak up for colleagues.\n\n8. Manages Time Well\n↳ Is self-organised & self-managing.\n↳ Will provide updates clearly.\n↳ Is on top of all tasks.\n\n9. Enjoys Being Wrong\n↳ Will embrace different viewpoints.\n↳ Will own their mistakes.\n↳ Has a growth mindset.\n\nYes, qualifications may get you through the door…\nBut showing these traits will truly help you excel.\n\nWhich is the most important trait for you?\nLet me know in the comments ⬇️\n\n♻️ Repost this to help others in your network build a business\nAnd follow Chris Donnelly for more!"
  },
  {
    "id": 7,
    "post": "10 Visuals that will change the way you think.\n\nShift how you perceive things.\n\nThank you to Pejman Milani for these fantastic visuals 🔥\n\n1. Writing > Thinking\n↳ Writing your thoughts down creates clarity.\n↳ A clear mind is sharper, more productive, and more effective.\n\n2. Managing vs leadership\n↳ A manager restricts you, whereas a leader guides you.\n↳ Leaders make a real impact, whereas managers only make decisions.\n\n3. Don’t use fancy words\n↳ Simple sells. Using complicated language only limits you.\n↳ The goal should be to make people understand your thought process.\n\n4. The power of purpose\n↳ It’s perfectly normal to experience imposter syndrome.\n↳ But once you find your purpose you will be able to push past it.\n\n5. The truth about failure\n↳ Failure is never a bad thing as long as you learn.\n↳ Shift your mindset to view failure as an opportunity.\n\n6. Storytelling and its impact\n↳ The impact of a story depends on how you tell it.\n↳ Storytelling is one of the highest-leverage skills you can build.\n\n7. Resourcefulness is key\n↳ Most of us have access to the right tools yet won’t use them.\n↳ Be resourceful and leverage these tools to help you unlock success.\n\n8. Clarity with writing\n↳ Writing stops you from being stuck in your own thoughts.\n↳ Even 5 minutes can make a huge difference to your clarity levels.\n\n9. Complete creativity\n↳ Creativity can come from anything, not just your positivity.\n↳ Embrace all emotions and learn to leverage them to your advantage.\n\n10. Fill your cup first\n↳ You have to be at your best to give your best to others.\n↳ It’s much easier to help others when you are feeling great yourself.\n\n10 truly incredible lessons.\nGiving you the perspective to change your life.\n\nWhich visual was your favourite?\nLet me know in the comments ⬇️\n\n♻️ Repost this to share this sheet with your network.\nAnd follow Chris Donnelly for more!"
  },
  {
    "id": 8,
    "post": "Invest in your people.\n\nIt’s their work, their skill and their commitment that will define your business.\n\nThe very least you can do in return is pay them what they’re worth.\n\nIf you like this content and it resonates, follow me Chris Donnelly for more."
  },
  {
    "id": 9,
    "post": "Boss vs Leader - The Ultimate Comparison\n\n10 FREE Management Courses to Try Today:\n\nA fantastic resource post from Project Management\n\n1. Google Project Management: Professional Certificate\nTaught by Google employees whose foundations in project management launched their own careers.\n↳ https://lnkd.in/dz7gKfTN\n\n2. IBM Project Manager Professional Certificate\nBuild the knowledge, skills and portfolio to have a competitive advantage in the job market.\n↳ https://lnkd.in/drqTnbdk\n\n3. AI Product Management Specialization\nLearn how to manage the Design & Development of Machine Learning Products.\n↳ https://lnkd.in/dGEFqQgJ\n\n4. Fundamentals of Project Planning and Management\nGoes over the core concepts of planning and executing projects.\n↳ https://lnkd.in/d9xk4RUk\n\n5. Scrum Master Certification Specialization\nUnderstand how to manage tasks and events within a Sprint.\n↳ https://lnkd.in/dAM_zwcK\n\n6. Project Management: Tools, Approaches, Behavioural Skills\nLearn the main project management tools, techniques and approaches to plan and control projects\n↳ https://lnkd.in/dn25rt-Z\n\n7. Agile with Atlassian Jira\nUnderstand the common fundamental principles and practices used by agile methodologies\n↳ https://lnkd.in/dtaiBV6S\n\n8. Software Product Management Specialization\nApply Agile software management practices to team leadership and real projects as a Software Product Manager.\n↳ https://lnkd.in/dixCqGkt\n\n9. Project Management Principles and Practices Specialization\nBe equipped with the skills to guarantee project success, within budget and on time.\n↳ https://lnkd.in/dZ4UR_Uw\n\n10. Engineering Project Management Specialisation\nGain a foundation of knowledge, skills, and confidence that sets you apart as you move toward leadership positions.\n↳ https://lnkd.in/d-pbwjJg\n\nDisclaimer: Here’s how to Enroll on the courses for free\n↳ https://lnkd.in/d2ffvsrf\n\n♻️ Repost this to share this sheet with your network.\nAnd follow Chris Donnelly\n\nDo you want a high-resolution PDF of all these courses and their links?\n\n1. ♻️ Repost this to your network\n2. Comment on this post\n3. Follow Chris Donnelly\n4. Subscribe to: https://lnkd.in/eXSNaDiu"
  },
  {
    "id": 10,
    "post": "10 Visuals that will change the way you think.\n\nShift how you perceive things.\n\nThese incredible graphics are created by Pejman Milani 🔥\n\n1. Thinking vs writing\n↳ Writing down your thoughts = Clarity.\n↳ A clear mind is a powerful mind.\n\n2. Managing vs leadership\n↳ A manager constructs, whereas a leader inspires.\n↳ Leaders make an impact, whereas managers simply make decisions.\n\n3. Fancy words vs simple words\n↳ Simple sells. Using complicated language limits reach.\n↳ The goal should be to make people understand it in the moment.\n\n4. The power of purpose\n↳ It’s perfectly normal to experience self-doubt and procrastination.\n↳ You can push past these all with a strong purpose.\n\n5. The reality of failure\n↳ Failure is never a bad thing as long as you learn.\n↳ Fail fast and iterate even quicker.\n\n6. The impact of storytelling\n↳ It’s not what’s happened, it’s how you frame it with storytelling.\n↳ One of the highest-leverage skills you can develop.\n\n7. The beauty of resourcefulness\n↳ Most of us have access to the right tools yet won’t create the opportunities.\n↳ Being resourceful is completely game-changing in business.\n\n8. Clarity with writing\n↳ It’s so easy to be stuck in your thoughts. Writing stops that.\n↳ Even 5 minutes can make a huge difference to your clarity.\n\n9. Complete creativity\n↳ Creativity can come from anything, not just your positive thoughts.\n↳ Embrace all moods to find your creative spark.\n\n10. Fill your cup first\n↳ You have to be at your best to give your best to others.\n↳ It’s far easier to help when you feel great yourself.\n\n10 truly powerful lessons.\nGiving you the perspective to change your life.\n\nWhich image was the most powerful for you?\nLet me know in the comments ⬇️\n\n- - - - -\n\nRepost ♻️ this to inspire your network and follow Chris Donnelly for more."
  }
]